Revit 2027 API
ParameterTypeId.PhyMaterialParamShearStrengthReduction Property
 "Shear strength modification"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PhyMaterialParamShearStrengthReduction { get; }
Public Shared ReadOnly Property PhyMaterialParamShearStrengthReduction As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PhyMaterialParamShearStrengthReduction {
	ForgeTypeId^ get ();
}
static member PhyMaterialParamShearStrengthReduction : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace